app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
    #GET /articles/:id
        @article = Article.find(params[:id])

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Post nuevoo"], ["body", "Este es un nuevo post !!"], ["created_at", "2019-04-23 15:53:19.430834"], ["updated_at", "2019-04-23 15:53:19.430834"]]
---
    def create
        @article = Article.new(title: params[:article][:title],
                                body: params[:article][:body])
        @article.save